{
  "backend/main.mo": "Defines actor with Nakshatra calculations, user profiles, logging types, and helper functions for lunar computations and access control.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides concise descriptions of multiple frontend components, pages, and hooks for reference.",
  "frontend/DEPLOYMENT_FAILURE_REPORT.md": "Template for documenting deployment failures with metadata, failing step, and error output sections.",
  "frontend/DEPLOYMENT_RUNBOOK.md": "Runbook outlining Version 24 deployment steps, prerequisites, and required checks.",
  "frontend/DEPLOYMENT_VERIFICATION.md": "Checklist for verifying Version 24 production deployment, including URL checks and console boot logs.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme variables and base styling.",
  "frontend/index.html": "Base HTML document loading Inter font and mounting the app root with cache-control headers.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes and wrapping UI with theme provider and error boundary.",
  "frontend/src/components/alerts/AlertsToggle.tsx": "UI toggle for enabling Nakshatra alerts using custom bell glyph and Switch component.",
  "frontend/src/components/alerts/NakshatraChangeBanner.tsx": "Displays dismissible banner when Nakshatra changes, showing tone-shift text and custom shift glyph.",
  "frontend/src/components/auth/LoginButton.tsx": "Handles Internet Identity login/logout with error sanitization, cache clearing, and deployment error logging.",
  "frontend/src/components/auth/RequireAuth.tsx": "Renders a sign‑in prompt when no identity is present and otherwise shows its children.",
  "frontend/src/components/city/CityPicker.tsx": "Modal for selecting a city or using geolocation, including search, error handling, and state updates.",
  "frontend/src/components/errors/AppErrorBoundary.tsx": "Error boundary that catches app errors, shows details, and allows copying a report or reloading.",
  "frontend/src/components/errors/ConnectionFailedScreen.tsx": "Displays a connection failure message with retry and optional sanitized error details.",
  "frontend/src/components/errors/UnableToProceedScreen.tsx": "Shows an inability‑to‑proceed message with retry support and optional error detail display.",
  "frontend/src/components/glyphs/Glyph.tsx": "SVG component rendering various glyph icons based on a type prop.",
  "frontend/src/components/layout/AppHeader.tsx": "Top navigation header with links, city picker trigger, alerts toggle, and login button.",
  "frontend/src/components/layout/AppLayout.tsx": "Overall app layout with header, routed content outlet, and footer showing attribution and version.",
  "frontend/src/components/nakshatra/NakshatraCalculatorSection.tsx": "Form component for entering birth details, computing nakshatra data, and optionally saving results using related hooks.",
  "frontend/src/components/nakshatra/NakshatraListItem.tsx": "Displays a clickable card summarizing a nakshatra with name, deity, symbols, and ruler, linking to its detail page.",
  "frontend/src/components/nakshatra/NakshatraSections.tsx": "Renders detailed nakshatra information including symbolism, traits, and themes using cards and accordions.",
  "frontend/src/components/nakshatra/TransitionTimes.tsx": "Calculates and displays estimated times for next pada and nakshatra transitions based on lunar movement.",
  "frontend/src/components/today/DailyGuidanceModules.tsx": "Shows expandable guidance modules for the day's nakshatra, pulling structured content from daily data.",
  "frontend/src/components/today/DailyInterpretationBlocks.tsx": "Displays high‑level daily interpretations such as emotional climate and overall themes for the current nakshatra.",
  "frontend/src/components/today/DailyLogsPanel.tsx": "Provides tabs and forms for saving daily check‑ins, sleep logs, and dream logs tied to the current nakshatra.",
  "frontend/src/components/today/ResonanceSection.tsx": "Displays resonance between today's Nakshatra and the user's birth chart, showing Moon and Atmakaraka activations when applicable.",
  "frontend/src/data/cities.ts": "Defines a City interface and exports a list of major world cities with timezones and coordinates.",
  "frontend/src/data/nakshatraDailyContent.ts": "Provides detailed daily thematic content for each Nakshatra, including emotional climate, activities, and ritual suggestions.",
  "frontend/src/data/nakshatras.ts": "Defines Nakshatra structures with traits, symbols, deities, and padas, exporting a list of Nakshatra metadata.",
  "frontend/src/hooks/actorQueryKey.ts": "Generates stable React Query keys for actor-related queries for both anonymous and authenticated users.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an actor instance tied to identity, initializing access control and invalidating dependent queries on change.",
  "frontend/src/hooks/useActorInitStatus.ts": "Exposes initialization status of the actor query using a stable query key and provides a retry mechanism.",
  "frontend/src/hooks/useActorStable.ts": "Builds a stable actor instance with optional admin token initialization and handles dependent query invalidation.",
  "frontend/src/hooks/useCitySelection.ts": "Manages persistent city selection with validation, local time updates, and a refresh key for downstream computations.",
  "frontend/src/hooks/useDailyForecasts.ts": "Defines a temporary DailyForecastRecord type and a placeholder hook that returns empty forecast data until backend implementation is available.",
  "frontend/src/hooks/useDailyForecastSettings.ts": "Provides placeholder hooks for getting and setting the daily forecast enabled state, returning static values until backend support exists.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider to manage login state, stored identities, and authentication via Dfinity’s AuthClient.",
  "frontend/src/hooks/useLocalStorage.ts": "Custom hook syncing localStorage-backed state across components and tabs with an in-memory subscriber system.",
  "frontend/src/hooks/useNakshatraAlerts.ts": "Tracks nakshatra changes and shows an alert banner when the current nakshatra differs from the last seen value, using localStorage for persistence.",
  "frontend/src/hooks/useNakshatraCalculator.ts": "Provides mutations to compute nakshatra data and save birth data through the backend actor, with error handling and query invalidation.",
  "frontend/src/hooks/useNakshatraNow.ts": "Computes current lunar longitude, validates it, and queries the backend for the current nakshatra with retry and recomputation helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines the nakshatra determination query, handling actor readiness, longitude validation, error logging, and a custom refetch mechanism.",
  "frontend/src/hooks/useUserLogs.ts": "Contains queries and mutations for retrieving and saving user logs, including validation, query invalidation, and error handling.",
  "frontend/src/hooks/useUserProfile.ts": "Provides hooks to fetch and update the caller’s user profile via the backend actor with proper query invalidation.",
  "frontend/src/index.css": "Tailwind setup defining light and dark theme CSS variables and base typography styles.",
  "frontend/src/lib/appVersion.ts": "Exports the app version string.",
  "frontend/src/lib/astro/lunarLongitude.ts": "Computes a simplified lunar longitude based on days since J2000.",
  "frontend/src/lib/astro/tropicalZodiac.ts": "Maps ecliptic longitude to a tropical zodiac sign and formats the result.",
  "frontend/src/lib/diagnostics/deploymentReport.ts": "Provides standardized deployment error, warning, and info logging plus error report generation.",
  "frontend/src/lib/diagnostics/nakshatraDiagnostics.ts": "Logs nakshatra query failures and includes longitude validation and normalization helpers.",
  "frontend/src/lib/diagnostics/sanitizeError.ts": "Converts unknown error values into safe display strings.",
  "frontend/src/lib/diagnostics/startupDiagnostics.ts": "Logs startup version info and tags the root element with the app version.",
  "frontend/src/lib/insights/dreamThemeExtraction.ts": "Extracts keyword themes per nakshatra from dream logs while filtering stopwords.",
  "frontend/src/lib/insights/nakshatraInsights.ts": "Generates up to three insights from patterns in check-ins, sleep logs, and dream logs.",
  "frontend/src/lib/nakshatra/index.ts": "Provides helpers to create and match nakshatra slugs.",
  "frontend/src/lib/time/timezone.ts": "Formats dates and converts instants to specific timezones for calculations and display.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/DailyForecastsPage.tsx": "Page showing placeholder content for upcoming daily nakshatra forecasts behind auth.",
  "frontend/src/pages/HistoryInsightsPage.tsx": "Displays user history insights by fetching logs, generating patterns, and showing insights, history, and dream themes with loading and empty states.",
  "frontend/src/pages/KnowledgeBasePage.tsx": "Provides a searchable list of all nakshatras and displays matching items from the knowledge base.",
  "frontend/src/pages/NakshatraCalculatorPage.tsx": "Allows users to enter birth details, compute nakshatra data, and optionally save results if authenticated.",
  "frontend/src/pages/NakshatraDetailPage.tsx": "Shows detailed information for a specific nakshatra based on the URL slug, with navigation back to the knowledge list.",
  "frontend/src/pages/ProfileSettingsPage.tsx": "Enables authenticated users to view and edit profile details, premiums status, and birth data with loading and save handling.",
  "frontend/src/pages/TodayPage.tsx": "Computes and displays the current nakshatra, related guidance, logs, and resonance while handling loading, errors, and location validity.",
  "frontend/src/pages/TomorrowPage.tsx": "Calculates tomorrow’s lunar longitude to determine the upcoming nakshatra and displays related interpretations with error and retry logic.",
  "frontend/src/pages/VisualStyleSystemPage.tsx": "Placeholder page with no implemented UI or logic.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL and hash params, persist them in sessionStorage, and clear stored or hash-based parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, fonts, shadows, plugins, and extended theme settings.",
  "project_state.json": "Defines the project’s state, including deployment issues, required redeploy tasks, and feature request metadata."
}