{
  "backend/main.mo": "Motoko actor defining Nakshatra ranges and functions to determine a nakshatra and pada from lunar longitude.",
  "feature_evidence.json": "JSON report mapping features to impacted frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files for planning and documentation.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme CSS variables and global styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes and wraps the app in ThemeProvider and Toaster.",
  "frontend/src/components/alerts/AlertsToggle.tsx": "Toggle switch component enabling or disabling nakshatra change alerts.",
  "frontend/src/components/alerts/NakshatraChangeBanner.tsx": "Banner alert shown when the nakshatra changes, with dismiss control.",
  "frontend/src/components/city/CityPicker.tsx": "Dialog for selecting a city or using geolocation, with search, validation, and error handling.",
  "frontend/src/components/layout/AppHeader.tsx": "Header showing navigation, current city with local time, city picker button, and alerts toggle.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main application layout with header, routed content area, and footer.",
  "frontend/src/components/nakshatra/NakshatraListItem.tsx": "Renders a clickable card linking to a Nakshatra detail page, showing name, number, symbols, and ruler.",
  "frontend/src/components/nakshatra/NakshatraSections.tsx": "Displays detailed Nakshatra information including symbols, deity, traits, and pada breakdown using cards and accordions.",
  "frontend/src/components/nakshatra/TransitionTimes.tsx": "Calculates and shows estimated times for the next pada and nakshatra transitions based on moon movement.",
  "frontend/src/components/today/DailyInterpretationBlocks.tsx": "Shows daily interpretation content for a given Nakshatra, including emotional climate and a narrative description.",
  "frontend/src/data/cities.ts": "Provides a list of cities with names, timezones, coordinates, and optional geolocation flag.",
  "frontend/src/data/nakshatraDailyContent.ts": "Contains predefined daily interpretive text for each Nakshatra.",
  "frontend/src/data/nakshatras.ts": "Defines Nakshatra data including symbols, deity, traits, and detailed pada information.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useCitySelection.ts": "Manages the selected city with validation, localStorage syncing, and live local time updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and helpers for managing Internet Identity login, state, and AuthClient initialization.",
  "frontend/src/hooks/useLocalStorage.ts": "Custom hook for synced localStorage state with cross-tab and same‑tab subscriptions.",
  "frontend/src/hooks/useNakshatraAlerts.ts": "Tracks nakshatra changes and shows an alert banner when the current nakshatra differs from the last seen.",
  "frontend/src/hooks/useNakshatraNow.ts": "Polls lunar longitude based on city timezone and queries the current nakshatra.",
  "frontend/src/hooks/useQueries.ts": "Defines the nakshatra lookup query using an actor and react‑query.",
  "frontend/src/index.css": "Tailwind base styles and custom color variables for light and dark themes.",
  "frontend/src/lib/astro/lunarLongitude.ts": "Computes an approximate lunar longitude for a given date using a simplified formula.",
  "frontend/src/lib/nakshatra/index.ts": "Utilities for slug generation and lookup of nakshatras by slug.",
  "frontend/src/lib/time/timezone.ts": "Formats timezone transitions and constructs Date objects representing local time in a target timezone.",
  "frontend/src/main.tsx": "App entry point wiring React, react‑query, and InternetIdentityProvider.",
  "frontend/src/pages/KnowledgeBasePage.tsx": "Searchable list page displaying all nakshatras with filtering UI.",
  "frontend/src/pages/NakshatraDetailPage.tsx": "Detail page showing full information for a selected nakshatra using its slug.",
  "frontend/src/pages/TodayPage.tsx": "React page that displays the current Nakshatra and Pada for the selected city, including hero section, data card, transition times, and daily interpretation blocks.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, typography, animations, container settings, and theming utilities for the frontend.",
  "project_state.json": "Project state metadata describing the app’s purpose, architecture notes, known bugs, and implemented feature list for Daily Nakshatra."
}