{
  "backend/main.mo": "Actor computes 27 nakshatras, finds nakshatra by longitude, calculates pada, validates input, and exposes determineNakshatra query with detailed results.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, tests, and confidence ratings.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purpose and behavior of all major frontend components, hooks, and utilities.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and base styling.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with ThemeProvider and Toaster.",
  "frontend/src/components/alerts/AlertsToggle.tsx": "Toggle switch for enabling or disabling Nakshatra change alerts.",
  "frontend/src/components/alerts/NakshatraChangeBanner.tsx": "Alert banner shown when a Nakshatra transition occurs, with dismiss control.",
  "frontend/src/components/city/CityPicker.tsx": "Dialog for selecting a city or using geolocation, with search, validation, and error handling.",
  "frontend/src/components/layout/AppHeader.tsx": "Header with navigation, city selector, local time display, and alerts toggle.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout wrapper providing header, main content outlet, and footer.",
  "frontend/src/components/nakshatra/NakshatraListItem.tsx": "Displays a clickable card linking to a nakshatra detail page, showing its name, number, symbols, deity, and planetary ruler.",
  "frontend/src/components/nakshatra/NakshatraSections.tsx": "Renders detailed sections of a nakshatra including symbolism, traits, and pada breakdown using cards, lists, and accordions.",
  "frontend/src/components/nakshatra/TransitionTimes.tsx": "Calculates and displays estimated times for upcoming pada and nakshatra transitions based on moon movement and city timezone.",
  "frontend/src/components/today/DailyInterpretationBlocks.tsx": "Shows daily interpretation content for a given nakshatra, including emotional climate and a narrative day summary.",
  "frontend/src/data/cities.ts": "Defines a City interface and exports a list of major world cities with timezones and coordinates.",
  "frontend/src/data/nakshatraDailyContent.ts": "Provides daily interpretive text for each nakshatra, including emotional themes and a short narrative description.",
  "frontend/src/data/nakshatras.ts": "Defines the Nakshatra and Pada structures and exports detailed metadata for each nakshatra, including traits and padas.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useCitySelection.ts": "Manages the selected city with validation, localStorage sync, time updates, and exposes current city and local time.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity login, state management, and loading stored identities.",
  "frontend/src/hooks/useLocalStorage.ts": "Custom hook syncing state with localStorage across tabs and within the same tab using subscribers.",
  "frontend/src/hooks/useNakshatraAlerts.ts": "Tracks nakshatra changes and shows an alert banner when the current nakshatra differs from the last seen one.",
  "frontend/src/hooks/useNakshatraNow.ts": "Computes current lunar longitude for the selected city, validates it, and queries the backend for current nakshatra.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend nakshatra queries with validation, logging, and react-query integration.",
  "frontend/src/index.css": "Defines Tailwind base layers and CSS variables for light/dark themes with a parchment and gold palette.",
  "frontend/src/lib/astro/lunarLongitude.ts": "Implements a simplified lunar longitude calculation normalized to 0–360 degrees.",
  "frontend/src/lib/diagnostics/nakshatraDiagnostics.ts": "Provides logging helpers for nakshatra query failures plus longitude validation and normalization utilities.",
  "frontend/src/lib/nakshatra/index.ts": "Exports helpers to slugify nakshatra names and look up nakshatras by slug.",
  "frontend/src/lib/time/timezone.ts": "Utilities for converting and formatting times in arbitrary timezones using Intl.DateTimeFormat.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with react-query and Internet Identity providers.",
  "frontend/src/pages/KnowledgeBasePage.tsx": "Renders the Knowledge Base with a searchable list of all Nakshatras and displays matching items using NakshatraListItem. Shows an empty state when no results match the query.",
  "frontend/src/pages/NakshatraDetailPage.tsx": "Displays detailed information for a single Nakshatra retrieved by slug, including metadata and content sections. Shows a fallback error with navigation when the Nakshatra is not found.",
  "frontend/src/pages/TodayPage.tsx": "Fetches and displays the user's current Nakshatra with interpretations, handling loading, invalid longitude, and backend errors. Includes retry logic, city context, and daily UI elements like banners and transition times.",
  "frontend/src/pages/TomorrowPage.tsx": "Computes tomorrow’s lunar longitude for the selected city, then queries the backend for Nakshatra data and displays interpretations with loading and error handling. Updates calculations when the city or timezone changes.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, typography, animations, and layout settings with custom OKLCH color variables and plugin imports.",
  "project_state.json": "Describes the project state, features, issues, and architectural notes for the Daily Nakshatra app, indicating active bug-fix requests related to city selection and Nakshatra data loading."
}