{
  "backend/main.mo": "Motoko canister defining nakshatra calculations, user profiles, and logs with access control mixin and helper utilities.",
  "feature_evidence.json": "Feature evidence report listing implemented frontend fixes, involved files, components, and test IDs.",
  "frontend-file-summaries.txt": "Mapping of frontend file paths to short descriptions summarizing their purpose and behavior.",
  "frontend/index.css": "Tailwind base stylesheet defining light/dark theme CSS variables and global styling.",
  "frontend/index.html": "HTML entry point loading fonts, setting dark mode root class, and mounting the React app.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with ThemeProvider and toaster notifications.",
  "frontend/src/components/alerts/AlertsToggle.tsx": "UI switch component tied to nakshatra alert settings using a custom bell glyph.",
  "frontend/src/components/alerts/NakshatraChangeBanner.tsx": "Banner showing nakshatra change alerts with shift glyph, summary text, and dismiss button.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth and clearing queries on logout.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wrapper that shows a sign‑in card when unauthenticated and otherwise renders children.",
  "frontend/src/components/city/CityPicker.tsx": "Modal for selecting a city or using geolocation, with search filtering and error handling.",
  "frontend/src/components/errors/ConnectionFailedScreen.tsx": "Displays a connection failure message with retry button and optional error details.",
  "frontend/src/components/glyphs/Glyph.tsx": "Renders various custom SVG glyph icons based on a type prop.",
  "frontend/src/components/layout/AppHeader.tsx": "Top navigation header with links, city picker trigger, alerts toggle, and login button.",
  "frontend/src/components/layout/AppLayout.tsx": "App layout wrapper providing header, routed content area, and footer with version info.",
  "frontend/src/components/nakshatra/NakshatraListItem.tsx": "Clickable card displaying summary info for a nakshatra and linking to its detail page.",
  "frontend/src/components/nakshatra/NakshatraSections.tsx": "Displays detailed nakshatra info including symbols, deity, ruler, themes, and traits in cards and accordions.",
  "frontend/src/components/nakshatra/TransitionTimes.tsx": "Calculates and displays estimated times for next pada and nakshatra transitions based on current city timezone.",
  "frontend/src/components/today/DailyGuidanceModules.tsx": "Renders collapsible guidance modules for a given Nakshatra using daily content fields. Each module displays a themed section with an icon and text.",
  "frontend/src/components/today/DailyInterpretationBlocks.tsx": "Displays detailed daily interpretation blocks including emotional climate and a narrative 'day in the life' section for the selected Nakshatra.",
  "frontend/src/components/today/DailyLogsPanel.tsx": "Provides forms for submitting daily check-ins, sleep logs, and dream logs with sliders and text inputs, saving data via custom hooks.",
  "frontend/src/components/today/ResonanceSection.tsx": "Shows whether the current Nakshatra resonates with the user's birth chart and displays moon or atmakaraka activation messages.",
  "frontend/src/data/cities.ts": "Exports a list of major cities with names, timezones, and coordinates, along with a City interface.",
  "frontend/src/data/nakshatraDailyContent.ts": "Defines daily content structure and provides detailed daily descriptions for Nakshatras like Ashwini and Bharani.",
  "frontend/src/data/nakshatras.ts": "Defines Nakshatra metadata including traits, symbolism, deity, and padas, and exports a full list of Nakshatras.",
  "frontend/src/hooks/actorQueryKey.ts": "Utility to generate stable query keys for authenticated and anonymous users based on principal identity.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor tied to the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useActorInitStatus.ts": "Provides read‑only status and retry controls for the actor initialization query.",
  "frontend/src/hooks/useActorStable.ts": "Builds a stable actor instance keyed by principal and initializes it with an optional admin token.",
  "frontend/src/hooks/useCitySelection.ts": "Manages selected city with validation, localStorage syncing, and live local‑time updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Wraps Internet Identity auth flow, exposing identity, login/logout, and status tracking.",
  "frontend/src/hooks/useLocalStorage.ts": "Syncs state with localStorage across tabs and hook instances with subscriber notifications.",
  "frontend/src/hooks/useNakshatraAlerts.ts": "Tracks nakshatra changes and shows an alert banner when the current nakshatra differs from the last seen one.",
  "frontend/src/hooks/useNakshatraNow.ts": "Computes current lunar longitude for the selected city and fetches the corresponding nakshatra.",
  "frontend/src/hooks/useQueries.ts": "Queries the backend for the current nakshatra using the actor, validating longitude and exposing retry helpers.",
  "frontend/src/hooks/useUserLogs.ts": "React-query hooks for fetching and saving user logs, grouped by day, nakshatra, and type, with cache invalidation.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks to load and update the caller's user profile and birth chart using react-query with cache updates.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark theme variables, typography, and layout rules.",
  "frontend/src/lib/appVersion.ts": "Exports the application version constant.",
  "frontend/src/lib/astro/lunarLongitude.ts": "Computes an approximate lunar longitude using a simplified astronomical formula.",
  "frontend/src/lib/diagnostics/nakshatraDiagnostics.ts": "Helpers for logging nakshatra-related errors and validating/normalizing lunar longitude values.",
  "frontend/src/lib/diagnostics/sanitizeError.ts": "Utility to safely convert unknown error values into readable strings.",
  "frontend/src/lib/insights/dreamThemeExtraction.ts": "Extracts per-nakshatra dream themes by counting entries and deriving unique keywords.",
  "frontend/src/lib/insights/nakshatraInsights.ts": "Generates up to three insights from check-in, sleep, and dream logs based on repeated nakshatra patterns.",
  "frontend/src/lib/nakshatra/index.ts": "Provides helpers for generating and resolving nakshatra slugs.",
  "frontend/src/lib/time/timezone.ts": "Utilities for formatting dates and computing wall-clock times in specific timezones.",
  "frontend/src/main.tsx": "App entry point initializing React, react-query, Internet Identity, and global styles.",
  "frontend/src/pages/HistoryInsightsPage.tsx": "Authenticated page that loads user logs, generates insights and dream themes, and displays them in tabbed sections or shows placeholders when empty.",
  "frontend/src/pages/KnowledgeBasePage.tsx": "Displays searchable list of nakshatras with a filterable input and renders matching items from data.",
  "frontend/src/pages/NakshatraDetailPage.tsx": "Shows detailed view of a selected nakshatra using its slug, with number, themes, and structured sections, or a not-found screen.",
  "frontend/src/pages/ProfileSettingsPage.tsx": "Authenticated profile page allowing users to edit account info and birth chart details, loading and saving data via hooks.",
  "frontend/src/pages/TodayPage.tsx": "Determines the current nakshatra using location and user data, handles errors and loading states, and displays daily interpretations and logs.",
  "frontend/src/pages/TomorrowPage.tsx": "Calculates tomorrow’s lunar longitude, determines the nakshatra, manages validation/error states, and shows interpretation content.",
  "frontend/src/pages/VisualStyleSystemPage.tsx": "Empty page placeholder for visual style system.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and clearing them from the URL or storage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, fonts, container settings, shadows, and animations using plugins and custom CSS variables.",
  "project_state.json": "Project state metadata defining features, issues, and requested improvements related to fixing actor initialization and connection failures."
}