{
  "backend/main.mo": "Motoko actor computing Nakshatras, determining the active Nakshatra and Pada for a given lunar longitude with validation and detailed degree calculations.",
  "feature_evidence.json": "Feature evidence report listing font‑revert related features, affected files, components, and associated test IDs.",
  "frontend-file-summaries.txt": "Reference file providing short descriptions of all major frontend components, pages, hooks, and utilities.",
  "frontend/index.css": "Tailwind base stylesheet defining CSS variables for light/dark themes and applying global background, text, and border styles.",
  "frontend/index.html": "Basic HTML entrypoint that loads the React application into the root div and imports main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with ThemeProvider and Toaster components.",
  "frontend/src/components/alerts/AlertsToggle.tsx": "Toggle switch component controlling Nakshatra alert notifications with icon feedback.",
  "frontend/src/components/alerts/NakshatraChangeBanner.tsx": "Banner alert shown when a Nakshatra transition occurs, with dismiss action and transition details.",
  "frontend/src/components/city/CityPicker.tsx": "Dialog for selecting a city or using geolocation, with search, validation, and error handling.",
  "frontend/src/components/layout/AppHeader.tsx": "Header with branding, navigation links, current city/time display, and access to city picker and alert toggle.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main application layout with header, routed content, and footer.",
  "frontend/src/components/nakshatra/NakshatraListItem.tsx": "Renders a clickable card linking to a Nakshatra detail page with basic info and symbols.",
  "frontend/src/components/nakshatra/NakshatraSections.tsx": "Displays detailed Nakshatra information including symbols, traits, deity, themes, and padas in cards and accordions.",
  "frontend/src/components/nakshatra/TransitionTimes.tsx": "Calculates and displays upcoming Pada and Nakshatra transition times based on lunar movement and the user's timezone.",
  "frontend/src/components/today/DailyInterpretationBlocks.tsx": "Shows daily interpretation content for a given Nakshatra, including emotional climate and a narrative summary.",
  "frontend/src/data/cities.ts": "Defines a list of world cities with names, timezones, and optional coordinates, plus the City interface.",
  "frontend/src/data/nakshatraDailyContent.ts": "Provides daily interpretation text for each Nakshatra, grouped into thematic sections.",
  "frontend/src/data/nakshatras.ts": "Defines Nakshatra structures with symbols, traits, deities, rulers, and pada breakdowns, exporting the full dataset.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useCitySelection.ts": "Manages the user's selected city with validation, localStorage sync, and local time updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication with login, logout, and status tracking.",
  "frontend/src/hooks/useLocalStorage.ts": "Custom hook that syncs state with localStorage across tabs and same‑tab subscribers.",
  "frontend/src/hooks/useNakshatraAlerts.ts": "Tracks nakshatra changes and shows an alert banner when the current nakshatra differs from the last seen one.",
  "frontend/src/hooks/useNakshatraNow.ts": "Computes current lunar longitude for the selected city, validates it, and queries the backend for the current nakshatra.",
  "frontend/src/hooks/useQueries.ts": "Defines the nakshatra query using react‑query with validation, actor checks, and diagnostic logging.",
  "frontend/src/index.css": "Tailwind CSS setup defining color variables and base styles for light and dark themes.",
  "frontend/src/lib/astro/lunarLongitude.ts": "Implements a simplified lunar longitude calculation normalized to 0–360 degrees.",
  "frontend/src/lib/diagnostics/nakshatraDiagnostics.ts": "Provides helper logging for nakshatra query failures and a longitude validity check.",
  "frontend/src/lib/nakshatra/index.ts": "Helpers for generating and resolving nakshatra slugs from the dataset.",
  "frontend/src/lib/time/timezone.ts": "Time utilities for converting and formatting dates in arbitrary timezones.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, Internet Identity, and global styles.",
  "frontend/src/pages/KnowledgeBasePage.tsx": "Displays a searchable grid of all Nakshatras, filtering results by user query and rendering each item via NakshatraListItem.",
  "frontend/src/pages/NakshatraDetailPage.tsx": "Shows detailed information for a selected Nakshatra using its slug, including number, themes, and sectional content, with fallback if not found.",
  "frontend/src/pages/TodayPage.tsx": "Fetches and displays today's Nakshatra based on current city and lunar longitude, handling loading states, errors, and transition/interpretation components.",
  "frontend/src/pages/TomorrowPage.tsx": "Computes tomorrow’s lunar longitude for the selected city, queries Nakshatra data, and renders interpretations with error and loading handling.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and plugin integrations for the frontend.",
  "project_state.json": "Stores project metadata, current version, features, known issues, and architectural notes for the Daily Nakshatra app."
}