{
  "backend/main.mo": "Motoko actor managing nakshatra calculations, user profiles, logs, and access control with helpers for degree validation and daily state.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, related files, components, and confidence levels for release validation.",
  "frontend-file-summaries.txt": "Pre-generated summaries describing the purpose and UI behavior of various frontend React components and hooks.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme variables and base styles for the app.",
  "frontend/index.html": "Base HTML document loading the React app with dark mode class, fonts, and cache-control headers.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app in a dark-theme provider with toaster notifications.",
  "frontend/src/components/alerts/AlertsToggle.tsx": "Toggle switch component enabling or disabling nakshatra alerts using a custom bell glyph.",
  "frontend/src/components/alerts/NakshatraChangeBanner.tsx": "Banner shown when the nakshatra changes, displaying a shift message and dismiss button.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication and query cache reset.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wrapper component that displays a sign-in prompt when a user is not authenticated.",
  "frontend/src/components/city/CityPicker.tsx": "Dialog for selecting a city or using geolocation, including search, validation, and error handling.",
  "frontend/src/components/errors/ConnectionFailedScreen.tsx": "Displays a connection error with retry button and optional sanitized error details.",
  "frontend/src/components/glyphs/Glyph.tsx": "Renders various SVG glyph icons based on a provided type.",
  "frontend/src/components/layout/AppHeader.tsx": "Provides the main site header with navigation, city picker, alerts toggle, and login.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the overall page layout with header, content outlet, and footer including app version.",
  "frontend/src/components/nakshatra/NakshatraListItem.tsx": "Shows a clickable card summarizing a Nakshatra with name, number, deity, symbols, and ruler.",
  "frontend/src/components/nakshatra/NakshatraSections.tsx": "Renders detailed Nakshatra sections including symbolism, traits, and related thematic content.",
  "frontend/src/components/nakshatra/TransitionTimes.tsx": "Calculates and displays estimated times for next Pada and Nakshatra transitions based on city timezone.",
  "frontend/src/components/today/DailyGuidanceModules.tsx": "Shows expandable daily guidance modules for a given Nakshatra, each with themed content and icons.",
  "frontend/src/components/today/DailyInterpretationBlocks.tsx": "Renders daily interpretation content for a given Nakshatra using card sections for emotional, mental, social, and narrative descriptions.",
  "frontend/src/components/today/DailyLogsPanel.tsx": "Provides UI forms for daily mood, energy, sleep, and dream logs, saving entries via user log hooks.",
  "frontend/src/components/today/ResonanceSection.tsx": "Displays whether the current Nakshatra resonates with a user's birth chart, showing Moon or Atmakaraka activations.",
  "frontend/src/data/cities.ts": "Exports a list of world cities with names, timezones, and coordinates for location selection.",
  "frontend/src/data/nakshatraDailyContent.ts": "Contains structured daily interpretation text for each Nakshatra, including emotional tone, themes, and guidance.",
  "frontend/src/data/nakshatras.ts": "Defines full Nakshatra metadata including symbols, deity, traits, and padas for astrological reference.",
  "frontend/src/hooks/actorQueryKey.ts": "Builds a stable react-query key for actor-related queries, avoiding undefined elements.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on user identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useActorInitStatus.ts": "Tracks the initialization state of the actor via react-query and provides retry helpers.",
  "frontend/src/hooks/useActorStable.ts": "Creates and caches an authenticated or anonymous actor, reinitializing when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useCitySelection.ts": "Manages selected city with validation, localStorage sync, and live local-time updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useLocalStorage.ts": "Syncs state with localStorage, supporting cross-tab and same-tab updates with change notifications.",
  "frontend/src/hooks/useNakshatraAlerts.ts": "Tracks Nakshatra changes and shows an alert banner when a new Nakshatra is detected.",
  "frontend/src/hooks/useNakshatraNow.ts": "Computes current lunar longitude and fetches Nakshatra data based on city and computed values.",
  "frontend/src/hooks/useQueries.ts": "Defines Nakshatra query logic using actor readiness and longitude validation, with error logging and force-refetch support.",
  "frontend/src/hooks/useUserLogs.ts": "Provides queries and mutations for fetching and saving user logs through the backend actor with cache invalidation.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks for fetching and saving the current user's profile and birth chart using React Query and an actor API.",
  "frontend/src/index.css": "Tailwind base styles plus custom light/dark theme CSS variables and typography rules.",
  "frontend/src/lib/appVersion.ts": "Exports a constant indicating the app’s version string.",
  "frontend/src/lib/astro/lunarLongitude.ts": "Calculates an approximate lunar longitude for a given date using a simplified astronomical formula.",
  "frontend/src/lib/diagnostics/nakshatraDiagnostics.ts": "Provides logging utilities and helpers for validating and normalizing lunar longitude inputs.",
  "frontend/src/lib/diagnostics/sanitizeError.ts": "Converts unknown error values into safe display strings with fallbacks.",
  "frontend/src/lib/insights/dreamThemeExtraction.ts": "Extracts keyword themes from dream logs grouped by Nakshatra with basic stopword filtering.",
  "frontend/src/lib/insights/nakshatraInsights.ts": "Generates up to three insight strings from patterns in check-in, sleep, and dream logs grouped by Nakshatra.",
  "frontend/src/lib/nakshatra/index.ts": "Utility functions for transforming Nakshatra names to slugs and retrieving data by slug.",
  "frontend/src/lib/time/timezone.ts": "Timezone utilities for formatting and generating Date objects representing local time in a target timezone.",
  "frontend/src/main.tsx": "App entry point setting up React Query, identity provider, and rendering the main App component.",
  "frontend/src/pages/HistoryInsightsPage.tsx": "Displays user insights, history, and dream themes with tabs, loading states, and auth gating.",
  "frontend/src/pages/KnowledgeBasePage.tsx": "Searchable list page showing all Nakshatras with filtering and UI components.",
  "frontend/src/pages/NakshatraDetailPage.tsx": "Displays detailed information for a specific nakshatra using its slug, showing name, number, themes, and related sections.",
  "frontend/src/pages/ProfileSettingsPage.tsx": "Provides authenticated users with forms to edit profile info and birth chart settings, loading existing data via hooks.",
  "frontend/src/pages/TodayPage.tsx": "Determines and displays the current nakshatra with error handling, location status, guidance modules, and premium resonance sections.",
  "frontend/src/pages/TomorrowPage.tsx": "Computes tomorrow's lunar longitude to fetch and show the next day's nakshatra with diagnostic and error handling states.",
  "frontend/src/pages/VisualStyleSystemPage.tsx": "Empty placeholder page for visual style system content.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, supporting hash and query routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, container settings, fonts, shadows, and animations for the project.",
  "project_state.json": "Metadata describing project state, feature lists, and pending requests for Version 22 deployment."
}