{
  "backend/main.mo": "Motoko canister defining Nakshatra calculations, user profile types, logs, birth chart storage, and access‑controlled user data operations.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, related files, components, and test IDs for recent enhancements.",
  "frontend-file-summaries.txt": "Text file containing concise descriptions of frontend components, hooks, and pages.",
  "frontend/DEPLOYMENT_VERIFICATION.md": "Checklist for verifying successful production deployment of Version 24.",
  "frontend/index.css": "Tailwind CSS base file defining light and dark theme design tokens and global styling.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the React application in dark mode.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, wraps app in ThemeProvider, and initializes Toaster notifications.",
  "frontend/src/components/alerts/AlertsToggle.tsx": "Toggle UI for enabling or disabling Nakshatra alert notifications.",
  "frontend/src/components/alerts/NakshatraChangeBanner.tsx": "Banner component showing Nakshatra shift alerts with dismiss controls.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with query cache clearing.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wrapper that blocks access and shows a sign‑in prompt when the user is not authenticated.",
  "frontend/src/components/city/CityPicker.tsx": "Modal allowing users to select a city or use geolocation, with search filtering and error handling.",
  "frontend/src/components/errors/ConnectionFailedScreen.tsx": "Displays a connection failure message with retry button and optional error details.",
  "frontend/src/components/errors/UnableToProceedScreen.tsx": "Shows an error screen for failed readings with retry option and expandable error details.",
  "frontend/src/components/glyphs/Glyph.tsx": "Renders various SVG glyph icons based on a provided type.",
  "frontend/src/components/layout/AppHeader.tsx": "Top navigation bar with site links, city selector, alerts toggle, and login button.",
  "frontend/src/components/layout/AppLayout.tsx": "Page layout wrapper providing header, footer, and main content outlet with version info.",
  "frontend/src/components/nakshatra/NakshatraListItem.tsx": "Clickable card linking to a nakshatra detail page, showing name, number, deity, and symbols.",
  "frontend/src/components/nakshatra/NakshatraSections.tsx": "Displays detailed sections of a nakshatra including symbolism, traits, themes, and structured accordion content.",
  "frontend/src/components/nakshatra/TransitionTimes.tsx": "Calculates hours until the next pada and nakshatra transitions using lunar movement and displays formatted times for the user's selected city.",
  "frontend/src/components/today/DailyGuidanceModules.tsx": "Renders accordion-based guidance modules for a given nakshatra using predefined daily content and glyph icons.",
  "frontend/src/components/today/DailyInterpretationBlocks.tsx": "Displays detailed narrative blocks describing the emotional, mental, social, and daily themes for the selected nakshatra.",
  "frontend/src/components/today/DailyLogsPanel.tsx": "Provides forms for mood check-ins, energy/restlessness sliders, and sleep/dream logs, saving entries via user log hooks.",
  "frontend/src/components/today/ResonanceSection.tsx": "Compares the current nakshatra with birth chart data and shows whether Moon or Atmakaraka resonance is active today.",
  "frontend/src/data/cities.ts": "Exports a list of global cities with names, timezones, coordinates, and optional geolocation flag.",
  "frontend/src/data/nakshatraDailyContent.ts": "Contains structured daily interpretation data for each nakshatra, including feelings, themes, rituals, and guidance text.",
  "frontend/src/data/nakshatras.ts": "Defines interfaces for Nakshatra and Pada and exports a detailed list of nakshatra metadata and traits.",
  "frontend/src/hooks/actorQueryKey.ts": "Provides a helper to build stable actor query keys that avoid undefined values.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to identity changes, refetching dependent queries when the actor updates.",
  "frontend/src/hooks/useActorInitStatus.ts": "Reports the initialization status of the actor query and provides a retry function using a stable query key.",
  "frontend/src/hooks/useActorStable.ts": "Creates a stable actor instance with optional access-control initialization and retries, invalidating dependent queries on change.",
  "frontend/src/hooks/useCitySelection.ts": "Manages selected city with validation, localStorage sync, and local time updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context and logic for loading, logging in, and clearing identity using Dfinity AuthClient.",
  "frontend/src/hooks/useLocalStorage.ts": "Implements a synchronized localStorage hook with same‑tab and cross‑tab state updates.",
  "frontend/src/hooks/useNakshatraAlerts.ts": "Tracks nakshatra changes and manages user alert preferences using localStorage.",
  "frontend/src/hooks/useNakshatraNow.ts": "Computes current lunar longitude, validates it, and queries the current nakshatra with retry and recompute logic.",
  "frontend/src/hooks/useQueries.ts": "Hook that queries backend for Nakshatra determination with validation, diagnostics, and forced refetch support.",
  "frontend/src/hooks/useUserLogs.ts": "Hooks to fetch and mutate user logs via the actor, including check-ins, sleep logs, dream logs, and pattern queries.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks to load and update the caller’s user profile and birth chart using react-query.",
  "frontend/src/index.css": "Tailwind base styles defining light/dark theme variables and typography rules.",
  "frontend/src/lib/appVersion.ts": "Exports the current app version string.",
  "frontend/src/lib/astro/lunarLongitude.ts": "Provides a simplified lunar longitude calculation based on days since J2000.",
  "frontend/src/lib/diagnostics/nakshatraDiagnostics.ts": "Diagnostics utilities for Nakshatra queries, including logging, longitude validation, and normalization.",
  "frontend/src/lib/diagnostics/sanitizeError.ts": "Utility to convert unknown error values into safe display strings.",
  "frontend/src/lib/insights/dreamThemeExtraction.ts": "Extracts keyword themes from dream logs grouped by Nakshatra, filtering stopwords and limiting keywords.",
  "frontend/src/lib/insights/nakshatraInsights.ts": "Generates up to three insights from check-in, sleep, and dream logs based on repeated Nakshatra patterns.",
  "frontend/src/lib/nakshatra/index.ts": "Helpers for looking up nakshatras and generating URL slugs from their names.",
  "frontend/src/lib/time/timezone.ts": "Timezone utilities to format dates and compute local-time Date objects for lunar calculations.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/HistoryInsightsPage.tsx": "Displays user log–based insights, history, and dream themes with authentication and loading states.",
  "frontend/src/pages/KnowledgeBasePage.tsx": "Provides a searchable list of all nakshatras using a simple text filter.",
  "frontend/src/pages/NakshatraDetailPage.tsx": "Shows detailed information for a specific nakshatra with navigation and sections.",
  "frontend/src/pages/ProfileSettingsPage.tsx": "Allows authenticated users to edit profile info and birth chart data, with save operations and loading states.",
  "frontend/src/pages/TodayPage.tsx": "Fetches and displays today’s nakshatra data, handling geolocation, backend readiness, errors, and premium modules.",
  "frontend/src/pages/TomorrowPage.tsx": "Computes and displays tomorrow’s nakshatra using projected lunar longitude, with error and loading handling.",
  "frontend/src/pages/VisualStyleSystemPage.tsx": "Empty page file with no implemented content.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters (including hash routes), storing them in sessionStorage, and retrieving or clearing persisted values.",
  "frontend/tailwind.config.js": "Defines the Tailwind CSS configuration with custom colors, typography, container settings, animations, and extended theme values.",
  "project_state.json": "Describes the project’s state, including requirements to fix profile save failures and add Lahiri-based Nakshatra calculations with persistence."
}