{
  "backend/main.mo": "Motoko canister defining nakshatra calculations plus in‑memory maps for user profiles, logs, and access control.",
  "feature_evidence.json": "Feature evidence listing two TodayPage hero image and layout changes with associated files and metadata.",
  "frontend-file-summaries.txt": "Text file containing short summaries of key frontend files and components.",
  "frontend/index.css": "Tailwind CSS configuration defining light/dark theme tokens and base styles.",
  "frontend/index.html": "HTML entry point loading Inter font and bootstrapping the React app.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes and wrapping with ThemeProvider and Toaster.",
  "frontend/src/components/alerts/AlertsToggle.tsx": "Toggle component for enabling or disabling nakshatra alerts with custom bell glyph.",
  "frontend/src/components/alerts/NakshatraChangeBanner.tsx": "Banner component showing a nakshatra shift notification with dismiss action.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading and error handling.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wrapper component gating content behind authentication with a sign‑in prompt.",
  "frontend/src/components/city/CityPicker.tsx": "Modal for selecting a city or using geolocation, with search filtering and error handling.",
  "frontend/src/components/glyphs/Glyph.tsx": "Renders various SVG glyph icons based on a provided type.",
  "frontend/src/components/layout/AppHeader.tsx": "Top navigation bar with links, city picker trigger, alerts toggle, and login button.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with header, routed content area, and footer including version info.",
  "frontend/src/components/nakshatra/NakshatraListItem.tsx": "Displays a clickable card summarizing a nakshatra with name, number, symbols, and ruler.",
  "frontend/src/components/nakshatra/NakshatraSections.tsx": "Shows detailed nakshatra sections including symbolism, traits, themes, and other attributes using cards and accordions.",
  "frontend/src/components/nakshatra/TransitionTimes.tsx": "Calculates and displays estimated transition times for the next pada and nakshatra based on moon movement.",
  "frontend/src/components/today/DailyGuidanceModules.tsx": "Renders daily guidance modules for a selected nakshatra using an accordion with themed content.",
  "frontend/src/components/today/DailyInterpretationBlocks.tsx": "Displays daily interpretation sections for a selected nakshatra using themed cards and pulls text from nakshatraDailyContent.",
  "frontend/src/components/today/DailyLogsPanel.tsx": "Provides forms for daily check-in, sleep, and dream logs, saving entries via user log hooks.",
  "frontend/src/components/today/ResonanceSection.tsx": "Shows whether the current nakshatra resonates with the user's birth chart based on stored logs.",
  "frontend/src/data/cities.ts": "Exports a list of predefined cities with names, timezones, coordinates, and optional geolocation flag.",
  "frontend/src/data/nakshatraDailyContent.ts": "Defines detailed daily content for each nakshatra including mood, themes, and guidance.",
  "frontend/src/data/nakshatras.ts": "Defines static metadata for all nakshatras, including traits, symbols, deity, and padas.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useCitySelection.ts": "Manages the selected city with validation, localStorage sync, and live local time updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, and identity persistence using AuthClient.",
  "frontend/src/hooks/useLocalStorage.ts": "Custom hook syncing state with localStorage across tabs and within the same tab.",
  "frontend/src/hooks/useNakshatraAlerts.ts": "Tracks nakshatra changes and shows an alert banner when a new nakshatra is detected.",
  "frontend/src/hooks/useNakshatraNow.ts": "Computes and polls lunar longitude, validating it and querying nakshatra data based on city time.",
  "frontend/src/hooks/useQueries.ts": "React Query wrapper to fetch nakshatra data from the backend with validation and error logging.",
  "frontend/src/hooks/useUserLogs.ts": "Provides queries and mutations for fetching and saving user logs, sleep logs, and dream logs.",
  "frontend/src/hooks/useUserProfile.ts": "Fetches and updates user profile and birth chart data through backend actor methods.",
  "frontend/src/index.css": "Tailwind base styles defining light/dark themes, typography, and layout defaults.",
  "frontend/src/lib/appVersion.ts": "Exports the current application version string.",
  "frontend/src/lib/astro/lunarLongitude.ts": "Calculates an approximate lunar longitude based on a given date using a simplified formula.",
  "frontend/src/lib/diagnostics/nakshatraDiagnostics.ts": "Provides helpers for logging Nakshatra query failures and utilities for longitude validation and normalization.",
  "frontend/src/lib/insights/dreamThemeExtraction.ts": "Extracts keyword themes from dream logs by grouping entries by nakshatra and filtering unique non‑stopword terms.",
  "frontend/src/lib/insights/nakshatraInsights.ts": "Generates up to three user insights by analyzing check-in patterns for energy, mood, and restlessness grouped by nakshatra.",
  "frontend/src/lib/nakshatra/index.ts": "Exports utilities to create slugs from nakshatra names and retrieve nakshatra data by slug.",
  "frontend/src/lib/time/timezone.ts": "Formats dates and constructs timezone-adjusted Date objects for current or specific instants, with fallbacks on errors.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/HistoryInsightsPage.tsx": "Displays insights, history, and dream themes based on user logs with tabbed navigation and loading states.",
  "frontend/src/pages/KnowledgeBasePage.tsx": "Renders a searchable list of all nakshatras for browsing the knowledge base.",
  "frontend/src/pages/NakshatraDetailPage.tsx": "Shows detailed information for a single nakshatra identified by slug, with navigation back to the knowledge base.",
  "frontend/src/pages/ProfileSettingsPage.tsx": "Provides forms for editing user profile information and birth chart settings, loading existing data when available.",
  "frontend/src/pages/TodayPage.tsx": "Renders the Today view using current lunar data, with error and loading states and a hero section background image.",
  "frontend/src/pages/TomorrowPage.tsx": "Computes tomorrow’s lunar longitude and renders the forecast with validation, error handling, and retry logic.",
  "frontend/src/pages/VisualStyleSystemPage.tsx": "Empty placeholder page.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session-based parameters, including hash routing support.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending theme colors, typography, shadows, animations, and container settings.",
  "project_state.json": "Project metadata tracking current issues and feature requirements for fixing the Today page hero image and text positioning."
}