{
  "backend/main.mo": "Motoko actor defining Nakshatra calculations, user profile data, logging structures, and access‑controlled storage maps with helpers for degree validation and lunar day computations.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test IDs for traceability.",
  "frontend-file-summaries.txt": "Prewritten summaries for multiple frontend files describing UI structure, hooks, components, and behavior.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme variables and base styling rules.",
  "frontend/index.html": "HTML entry point loading Inter font and mounting the React app with a dark theme class.",
  "frontend/src/App.tsx": "React router setup with themed layout, defining routes for Today, Tomorrow, Knowledge, Nakshatra detail, History, and Profile pages.",
  "frontend/src/components/alerts/AlertsToggle.tsx": "UI toggle for enabling or disabling Nakshatra alerts using a custom bell glyph.",
  "frontend/src/components/alerts/NakshatraChangeBanner.tsx": "Dismissible banner that announces detected Nakshatra changes with tone‑shift messaging.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with loading states and automatic recovery for duplicate sessions.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wrapper component that restricts content to authenticated users, showing a sign‑in card when unauthenticated.",
  "frontend/src/components/city/CityPicker.tsx": "Modal UI for selecting a city or using geolocation, including search, error handling, and updating current city.",
  "frontend/src/components/glyphs/Glyph.tsx": "Renders various SVG glyph icons based on a type prop.",
  "frontend/src/components/layout/AppHeader.tsx": "Top navigation bar with links, city picker trigger, alerts toggle, and login button.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with header, routed content outlet, and footer including version info.",
  "frontend/src/components/nakshatra/NakshatraListItem.tsx": "Card-style link displaying basic nakshatra info like name, number, symbols, and ruler.",
  "frontend/src/components/nakshatra/NakshatraSections.tsx": "Detailed multi-section display of nakshatra symbolism, traits, themes, and related info.",
  "frontend/src/components/nakshatra/TransitionTimes.tsx": "Calculates and displays next pada and nakshatra transition times based on current city timezone.",
  "frontend/src/components/today/DailyGuidanceModules.tsx": "Accordion modules showing daily guidance content for a given nakshatra with glyph icons.",
  "frontend/src/components/today/DailyInterpretationBlocks.tsx": "Displays daily interpretation text for a selected nakshatra using card sections for emotional, mental, social, and rhythm themes plus a narrative block.",
  "frontend/src/components/today/DailyLogsPanel.tsx": "Provides forms for daily check-ins, sleep logs, and dream logs, saving entries via user log mutation hooks.",
  "frontend/src/components/today/ResonanceSection.tsx": "Shows whether the current nakshatra resonates with the user's birth chart and displays related messages.",
  "frontend/src/data/cities.ts": "Exports a list of major cities with timezones and coordinates for location selection or geolocation use.",
  "frontend/src/data/nakshatraDailyContent.ts": "Defines daily content descriptions for each nakshatra, including emotional tone, themes, and guidance.",
  "frontend/src/data/nakshatras.ts": "Provides structured metadata for all nakshatras, including traits, symbols, ruling deities, and padas.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages a backend actor based on authentication state, refreshing dependent queries on change.",
  "frontend/src/hooks/useActorInitStatus.ts": "Reads actor query status from the cache and exposes loading, success, and retry utilities.",
  "frontend/src/hooks/useCitySelection.ts": "Manages selected city with validation, localStorage sync, and live local time updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity auth, including login, logout, and stored identity loading.",
  "frontend/src/hooks/useLocalStorage.ts": "Custom hook for reactive localStorage with cross-tab and same-tab synchronization.",
  "frontend/src/hooks/useNakshatraAlerts.ts": "Tracks nakshatra changes and shows an alert banner when the current nakshatra differs from the last seen.",
  "frontend/src/hooks/useNakshatraNow.ts": "Computes current lunar longitude by city and fetches current nakshatra with polling and validation.",
  "frontend/src/hooks/useQueries.ts": "Wraps react-query to call actor.determineNakshatra with validation and actor initialization checks.",
  "frontend/src/hooks/useUserLogs.ts": "Provides queries and mutations for reading and writing user logs linked to an actor backend.",
  "frontend/src/hooks/useUserProfile.ts": "Fetches and updates user profile and birth chart data via actor-backed queries and mutations.",
  "frontend/src/index.css": "Tailwind base theme with light/dark CSS variables and typography styles.",
  "frontend/src/lib/appVersion.ts": "Exports a constant string for the application version.",
  "frontend/src/lib/astro/lunarLongitude.ts": "Computes an approximate lunar longitude using a simplified mean‑motion formula normalized to 0–360 degrees.",
  "frontend/src/lib/diagnostics/nakshatraDiagnostics.ts": "Provides diagnostic logging and helpers for validating and normalizing lunar longitudes.",
  "frontend/src/lib/insights/dreamThemeExtraction.ts": "Extracts per‑nakshatra dream themes by counting entries and pulling non‑stopword keywords.",
  "frontend/src/lib/insights/nakshatraInsights.ts": "Generates up to three user insights based on repeated check‑ins, analyzing energy, mood, and restlessness patterns by nakshatra.",
  "frontend/src/lib/nakshatra/index.ts": "Exports helpers to generate nakshatra slugs and look up nakshatras by slug.",
  "frontend/src/lib/time/timezone.ts": "Handles timezone‑aware date formatting and conversion, producing Date objects representing local times in specified zones.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/HistoryInsightsPage.tsx": "Fetches user logs and displays insights, history, and dream themes within a tabbed interface.",
  "frontend/src/pages/KnowledgeBasePage.tsx": "Displays searchable list of all nakshatras in the knowledge base.",
  "frontend/src/pages/NakshatraDetailPage.tsx": "Shows detailed information for a single nakshatra based on its slug.",
  "frontend/src/pages/ProfileSettingsPage.tsx": "Provides authenticated profile management including user info and birth chart settings.",
  "frontend/src/pages/TodayPage.tsx": "Displays the current nakshatra with hooks for location, identity, and backend status, showing error and retry states when data cannot be fetched.",
  "frontend/src/pages/TomorrowPage.tsx": "Calculates tomorrow’s lunar longitude and queries the backend for the next day’s nakshatra, handling invalid longitude and actor initialization errors.",
  "frontend/src/pages/VisualStyleSystemPage.tsx": "Empty placeholder page for visual style system content.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and cleaning them from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, typography, container settings, and custom animations.",
  "project_state.json": "Project metadata describing current issues and required fixes related to Today page blocking bugs and actor initialization behavior."
}