{
  "backend/main.mo": "Defines core actor logic for nakshatra calculations, user profiles, logging entries, and access control with helper functions for degree validation and nakshatra lookup.",
  "backend/migration.mo": "Migrates old user profiles to a new format by adding optional birthData and returns updated profile map.",
  "feature_evidence.json": "Stores feature evidence metadata linking features to related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all frontend files for reference or documentation.",
  "frontend/DEPLOYMENT_VERIFICATION.md": "Checklist for verifying successful production deployment of version 24, including UI, version label, and core functionality checks.",
  "frontend/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes with global styling rules.",
  "frontend/index.html": "HTML entry point loading root element, dark theme, Inter font, and main React script.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, including the new calculator page, and wraps the app with theme and toaster providers.",
  "frontend/src/components/alerts/AlertsToggle.tsx": "Provides a toggle switch for enabling or disabling nakshatra alerts using a custom bell glyph.",
  "frontend/src/components/alerts/NakshatraChangeBanner.tsx": "Displays a dismissible banner when the nakshatra changes, showing tone-shift content and a shift glyph.",
  "frontend/src/components/auth/LoginButton.tsx": "Renders login/logout button using Internet Identity, handling authentication state and query cache clearing.",
  "frontend/src/components/auth/RequireAuth.tsx": "Displays a sign-in prompt using Internet Identity when no identity is present; otherwise renders children.",
  "frontend/src/components/city/CityPicker.tsx": "Modal for selecting a city or using geolocation, with search, error handling, and updates to the selected city.",
  "frontend/src/components/errors/ConnectionFailedScreen.tsx": "Shows a connection failure message with retry and optional detailed error display.",
  "frontend/src/components/errors/UnableToProceedScreen.tsx": "Displays an error screen for failed readings, offering retry and optional error details.",
  "frontend/src/components/glyphs/Glyph.tsx": "Renders various inline SVG glyph icons based on a provided type.",
  "frontend/src/components/layout/AppHeader.tsx": "Header with navigation, city picker trigger, alerts toggle, and login button.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with header, routed content outlet, and footer showing version and link.",
  "frontend/src/components/nakshatra/NakshatraCalculatorSection.tsx": "Form and logic to compute and optionally save birth nakshatra data using date, time, and location.",
  "frontend/src/components/nakshatra/NakshatraListItem.tsx": "Renders a clickable card linking to a nakshatra detail page, showing its name, number, deity, symbols, and planetary ruler.",
  "frontend/src/components/nakshatra/NakshatraSections.tsx": "Displays detailed nakshatra information including symbols, deity, ruler, themes, and core traits using cards and accordions.",
  "frontend/src/components/nakshatra/TransitionTimes.tsx": "Calculates and displays estimated times for the next pada and nakshatra transitions based on moon movement and timezone.",
  "frontend/src/components/today/DailyGuidanceModules.tsx": "Shows collapsible daily guidance modules for a given nakshatra, including themes like awareness, sleep, social, creativity, and ritual.",
  "frontend/src/components/today/DailyInterpretationBlocks.tsx": "Renders interpretation blocks describing the day's emotional, mental, social, and productivity themes plus a narrative summary.",
  "frontend/src/components/today/DailyLogsPanel.tsx": "Provides forms for daily check-ins, sleep logs, and dream logs, saving entries tied to the current nakshatra and day of year.",
  "frontend/src/components/today/ResonanceSection.tsx": "Displays whether the current nakshatra aligns with the user's birth chart, showing Moon or Atmakaraka resonance if applicable.",
  "frontend/src/data/cities.ts": "Exports a list of world cities with names, timezones, coordinates, and optional geolocation flag.",
  "frontend/src/data/nakshatraDailyContent.ts": "Defines a DailyContent interface and provides daily interpretive content for each nakshatra, including emotional tone, workflow, and ritual suggestions.",
  "frontend/src/data/nakshatras.ts": "Defines Nakshatra and Pada structures and exports detailed metadata for each nakshatra including symbols, traits, and padas.",
  "frontend/src/hooks/actorQueryKey.ts": "Provides a helper to build stable actor query keys that avoid undefined values for anonymous users.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor via React Query, recreating it on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useActorInitStatus.ts": "Reads initialization status of the actor query and exposes status helpers plus a retry method using a stable query key.",
  "frontend/src/hooks/useActorStable.ts": "Creates a stable actor instance using a consistent query key and optional admin token, refetching dependent queries on changes.",
  "frontend/src/hooks/useCitySelection.ts": "Manages selected city with validation, local storage sync, and live local time updates.",
  "frontend/src/hooks/useDailyForecasts.ts": "Exposes a placeholder hook for fetching caller-specific daily forecasts, currently returning an empty list.",
  "frontend/src/hooks/useDailyForecastSettings.ts": "Provides placeholder hooks for getting and setting daily forecast settings, currently returning defaults until backend support exists.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication using AuthClient, including login state and persisted identities.",
  "frontend/src/hooks/useLocalStorage.ts": "Custom hook syncing state with localStorage and across tabs using subscribers to propagate updates.",
  "frontend/src/hooks/useNakshatraAlerts.ts": "Tracks Nakshatra changes and shows an alert banner based on stored last-seen values and current Nakshatra data.",
  "frontend/src/hooks/useNakshatraCalculator.ts": "Defines mutations to compute Nakshatra data and save birth data through the backend actor with cache invalidation.",
  "frontend/src/hooks/useNakshatraNow.ts": "Computes current lunar longitude, validates it, and queries the backend for the current Nakshatra with retry logic.",
  "frontend/src/hooks/useQueries.ts": "Implements Nakshatra determination query with backend validation, actor readiness checks, and forced refetch support.",
  "frontend/src/hooks/useUserLogs.ts": "Provides queries and mutations for fetching and saving user logs, invalidating related caches as needed.",
  "frontend/src/hooks/useUserProfile.ts": "Defines queries and mutations for retrieving and saving the caller's user profile via the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables, typography, and global styles.",
  "frontend/src/lib/appVersion.ts": "Exports a constant containing the application version string.",
  "frontend/src/lib/astro/lunarLongitude.ts": "Computes an approximate lunar longitude for a given date using a simplified astronomical formula.",
  "frontend/src/lib/diagnostics/nakshatraDiagnostics.ts": "Provides logging helpers for Nakshatra query failures and utilities for validating and normalizing longitude values.",
  "frontend/src/lib/diagnostics/sanitizeError.ts": "Converts unknown error inputs into safe display strings, handling Error objects, strings, and serializable objects.",
  "frontend/src/lib/insights/dreamThemeExtraction.ts": "Extracts keyword themes from dream logs per nakshatra by filtering stopwords and capturing up to ten unique frequent words.",
  "frontend/src/lib/insights/nakshatraInsights.ts": "Generates up to three insight strings based on repeated check‑in patterns for energy, mood, and restlessness per nakshatra.",
  "frontend/src/lib/nakshatra/index.ts": "Provides helpers to generate nakshatra slugs and retrieve nakshatra data by slug.",
  "frontend/src/lib/time/timezone.ts": "Formats dates and reconstructs wall‑clock times in specific timezones with fallbacks for invalid zones.",
  "frontend/src/main.tsx": "Initializes the React app with React Query and Internet Identity providers before rendering the root component.",
  "frontend/src/pages/DailyForecastsPage.tsx": "Displays a placeholder page for upcoming daily forecast features with authentication gating.",
  "frontend/src/pages/HistoryInsightsPage.tsx": "Shows user insights, history, and dream themes using fetched logs, with loading states and tabbed navigation.",
  "frontend/src/pages/KnowledgeBasePage.tsx": "Renders a searchable list of all nakshatras in the knowledge base.",
  "frontend/src/pages/NakshatraCalculatorPage.tsx": "Provides a form to compute and optionally save birth nakshatra data using user‑entered birth details and location.",
  "frontend/src/pages/NakshatraDetailPage.tsx": "Displays nakshatra details by slug, showing its name, number, themes, and section components with a return link.",
  "frontend/src/pages/ProfileSettingsPage.tsx": "Provides authenticated profile management including name, email, premium status, and related settings, with data loading and saving logic.",
  "frontend/src/pages/TodayPage.tsx": "Shows today's nakshatra data with loading, error, and location-handling states, plus guidance modules and premium resonance content.",
  "frontend/src/pages/TomorrowPage.tsx": "Calculates tomorrow’s lunar longitude to determine the nakshatra and renders results with error and retry handling.",
  "frontend/src/pages/VisualStyleSystemPage.tsx": "Empty placeholder page with no implemented content.",
  "frontend/src/utils/urlParams.ts": "Utility functions to read, persist, and clear URL parameters using query strings, hashes, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, fonts, containers, animations, and plugin setup.",
  "project_state.json": "JSON describing project state, known issues, existing features, and new feature requests for profile persistence and a Nakshatra Calculator."
}