{
  "kind": "build_request",
  "title": "Fix Today page 'Unable to proceed' blocking bug",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the Today page flow so users are not blocked by the \"Unable to proceed\" error state or an indefinite loading state when the nakshatra reading cannot be fetched; the page must always provide a clear, actionable recovery path (retry/reload) and should successfully proceed to show the current nakshatra when the backend becomes available again.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "please fix the unable to proceed bug"
        ]
      },
      "acceptanceCriteria": [
        "When the backend query for the current nakshatra fails, the Today page shows an error state with an actionable button that reliably triggers a new attempt (not a no-op).",
        "When the app cannot query because prerequisites are missing (e.g., actor not ready / query not eligible), the Today page does not remain stuck on a skeleton indefinitely; it shows a clear message explaining what is missing and offers a recovery action.",
        "After recovery (e.g., successful retry), the Today page proceeds to display nakshatra data without requiring a full page refresh."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Harden actor initialization so it cannot silently prevent the app from proceeding: ensure failures during actor setup (including any access-control initialization) are caught and surfaced to the UI, and do not block creation of a usable actor when possible (e.g., when an optional secret/admin token is absent).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "please fix the unable to proceed bug"
        ]
      },
      "acceptanceCriteria": [
        "If access-control initialization fails during actor creation, the app still obtains an actor instance when it is safe to do so, and the failure is reported (e.g., via error state/toast/log) instead of leaving the app unable to proceed.",
        "The actor hook exposes enough state to distinguish between \"actor still loading\" vs \"actor failed\" so pages can render an appropriate error UI instead of indefinite loading.",
        "Retrying actor initialization (via a user action such as reload/retry) results in a new initialization attempt."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the backend access-control initialization path (the method invoked by the frontend during actor setup) so that missing/empty optional secret token input does not trap and does not prevent normal, non-admin usage from proceeding.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "please fix the unable to proceed bug"
        ]
      },
      "acceptanceCriteria": [
        "Calling the backend access-control initialization method with an empty or missing secret does not trap and does not break subsequent calls to public methods like determineNakshatra.",
        "Normal users (non-admin) can load the Today page and successfully call determineNakshatra without requiring any admin token."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only UI component sources must be composed, not edited).",
    "Do not edit immutable frontend hook files listed in SYSTEM_CONTEXT (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx)."
  ],
  "nonGoals": [
    "No new features beyond fixing the blocking 'Unable to proceed' bug and related recovery/error handling.",
    "No third-party authentication providers beyond Internet Identity.",
    "No new real-time communication features (e.g., WebSockets)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}