{
  "kind": "build_request",
  "title": "Fix Today hero image loading and move hero text to bottom lower third",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the Today page hero background image so the new asset \"Untitled design (33).png\" reliably loads and renders as the hero background in the \"Current Nakshatra Placement\" section (no broken image/404), including handling special characters in the filename (spaces/parentheses) and ensuring the file is present in the correct frontend static assets location.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "the new image didn't work. please fix the bug"
        ]
      },
      "acceptanceCriteria": [
        "On the Today page, the hero section displays the intended background image (not the previous image, not a blank background).",
        "The browser network tab shows the hero image request returns 200 (no 404) and no console errors related to loading the hero image.",
        "The solution works in both development and production builds (static asset resolution is correct)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Reposition the hero overlay text content in the Today page hero (glyph, \"Current Nakshatra Placement\" heading, and subtitle) so it sits in the bottom lower third of the hero image area instead of centered, while keeping it readable (spacing/padding) across mobile and desktop.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "place the text in the bottom lower third of the image."
        ]
      },
      "acceptanceCriteria": [
        "The hero text block is visually located in the lower third of the hero area (not vertically centered).",
        "Text remains readable against the background (overlay/scrim still provides sufficient contrast).",
        "Layout remains responsive: on small screens the text does not overflow or clip and maintains appropriate bottom padding."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (shadcn components are read-only).",
    "Do not modify any frontend paths listed as immutable in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Backend must remain single-actor; no backend changes are required for this UI bugfix unless strictly necessary."
  ],
  "nonGoals": [
    "Do not redesign other sections of the Today page beyond the hero image loading and hero text positioning.",
    "Do not add new authentication methods or external services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}