{
  "kind": "build_request",
  "title": "Fix Current Position (GPS) city detection bugs",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-20",
      "text": "Implement a working “Use Current Position” flow that uses browser geolocation (navigator.geolocation) to detect the user’s latitude/longitude and set the app’s selected location accordingly, while keeping the existing manual City Picker selection as a fallback.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "current position is still not working.  can you fix the bugs?"
        ]
      },
      "acceptanceCriteria": [
        "City Picker provides a clear control labeled in English (e.g., \"Use Current Position\") to trigger location detection.",
        "If geolocation is supported and the user grants permission, the app updates the selected location immediately (header city label/local time and Today page computation update without refresh).",
        "If geolocation is not supported, permission is denied, or a timeout/error occurs, the UI shows an English error message and the user can still select a city manually without being blocked."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Update the city selection model/validation so a geolocation-derived selection can be persisted in localStorage and reloaded safely even though it may not be one of the predefined entries in frontend/src/data/cities.ts.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "current position is still not working.  can you fix the bugs?"
        ]
      },
      "acceptanceCriteria": [
        "A geolocation-derived selection (name + valid IANA timezone + optional lat/lng) can be saved to and restored from localStorage without being rejected by validation.",
        "If a stored geolocation-derived selection is missing required fields or contains an invalid timezone identifier, the app falls back to the default city (New York) without crashing.",
        "Existing predefined-city selection behavior continues to work (selecting London/Paris/etc. still persists and restores correctly)."
      ]
    },
    {
      "id": "REQ-22",
      "text": "When setting a location from geolocation, derive and store a timezone identifier in a way that does not require external APIs (e.g., use the device-resolved IANA timezone via Intl.DateTimeFormat().resolvedOptions().timeZone), and ensure Today page calculations use that timezone for local-time context.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "current position is still not working.  can you fix the bugs?"
        ]
      },
      "acceptanceCriteria": [
        "The geolocation-based selection includes a timezone string that passes Intl timezone formatting (no crashes in local time display).",
        "Today page continues to display \"Calculated for … local time (…timezone…)\" using the geolocation-derived timezone when current position is selected.",
        "Nakshatra results refresh correctly after selecting current position (no stale React Query result from the previously selected city/timezone)."
      ]
    }
  ],
  "constraints": [
    "Do not use any external geocoding/timezone web services or third-party APIs to map coordinates to timezone or city.",
    "Do not edit files under frontend/src/components/ui or any other paths listed in frontend.immutablePaths.",
    "Keep backend as a single Motoko actor; no backend changes are required unless absolutely necessary for this fix.",
    "All user-facing text must be in English."
  ],
  "nonGoals": [
    "Adding push notifications or background location tracking.",
    "Adding a full world-city database or reverse-geocoding from coordinates to a specific city name.",
    "Improving the astronomical accuracy of the lunar longitude algorithm beyond making the current-position selection work."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}