{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Production redeploy verification hardening for Version 24 (frontend)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add frontend-side deploy runbook and runtime version diagnostics to support a successful full redeploy verification.",
      "acceptanceCriteria": [
        "Deployment pipeline completes successfully (no 'Deployment didn't complete' status).",
        "Both frontend and backend canisters are deployed and reachable from the production URL."
      ],
      "file_operations": [
        {
          "path": "frontend/DEPLOYMENT_RUNBOOK.md",
          "operation": "create",
          "description": "Create a concise runbook describing how to rerun the full deployment and what artifacts/logs to capture for each step (frontend build, backend build, canister install/upgrade) when the deployment reports it didn't complete. Include where to find the production URL and what to check immediately after deployment."
        },
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Add a startup diagnostic that (1) logs the exact boot message referenced by the verification checklist (including the Version 24 string from APP_VERSION), and (2) sets the #root element attribute data-app-version=\"Version 24\" at runtime to support production verification."
        },
        {
          "path": "frontend/src/lib/diagnostics/startupDiagnostics.ts",
          "operation": "create",
          "description": "Add a small utility to centralize the startup diagnostic behavior (boot console message + root attribute assignment) so it can be reused and kept consistent across environments."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure production smoke checks for Version 24 are reliable (no blank screen), version label is verifiable, core navigation works, and Internet Identity login/logout is stable.",
      "acceptanceCriteria": [
        "Production URL loads without a blank screen and without critical console errors.",
        "Footer shows the version label \"Version 24\" (data-testid=\"app-version\").",
        "Navigation between core pages works (Today, Tomorrow, Knowledge Base, History, Profile).",
        "Internet Identity login/logout flow works in production."
      ],
      "file_operations": [
        {
          "path": "frontend/DEPLOYMENT_VERIFICATION.md",
          "operation": "modify",
          "description": "Update the Version 24 verification checklist to align with the app’s current behavior: explicitly call out checking the runtime boot log, checking #root data-app-version=\"Version 24\" (now set at runtime), and verifying navigation for the named core pages. Add a note to verify login/logout using the existing Internet Identity UI and confirm React Query cache is cleared on logout (per the authorization component guidance). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wrap the app router with a top-level error boundary so unexpected runtime errors do not present as a blank screen in production; render a user-friendly fallback and preserve a way to inspect sanitized error details. (Do not modify any files under frontend/src/components/ui.)"
        },
        {
          "path": "frontend/src/components/errors/AppErrorBoundary.tsx",
          "operation": "create",
          "description": "Create a reusable top-level React error boundary component that displays a safe fallback UI and uses existing error UI patterns (e.g., sanitized error details) so production failures are visible and diagnosable instead of a blank screen."
        },
        {
          "path": "frontend/src/components/auth/LoginButton.tsx",
          "operation": "modify",
          "description": "Harden production logging around login/logout failures: ensure errors are sanitized/clearly logged (without breaking UX) to support the production smoke check. This should continue to follow the authorization component’s Internet Identity login/logout guidance and keep clearing cached data on logout. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Improve frontend diagnostics so any repeated deployment failure or post-deploy runtime breakage is captured with concrete, reproducible output and minimal corrective changes.",
      "acceptanceCriteria": [
        "A concrete, reproducible error message is recorded for the failing step (e.g., frontend build, backend build, canister install/upgrade).",
        "Any required fix is implemented and the subsequent redeploy completes successfully."
      ],
      "file_operations": [
        {
          "path": "frontend/DEPLOYMENT_FAILURE_REPORT.md",
          "operation": "create",
          "description": "Add a structured template for recording a failed deployment attempt: failing step name, full error output, timestamp, commit/build identifier (if available), and reproduction notes. Include a section to paste browser console output from production when smoke checks fail."
        },
        {
          "path": "frontend/src/lib/diagnostics/deploymentReport.ts",
          "operation": "create",
          "description": "Add a small diagnostics helper that standardizes how runtime-critical errors are logged (using sanitizeError) and optionally tags messages with APP_VERSION to make production troubleshooting deterministic."
        },
        {
          "path": "frontend/src/components/errors/AppErrorBoundary.tsx",
          "operation": "modify",
          "description": "Extend the error boundary fallback to surface a copyable sanitized error string (for deterministic bug reports) and reference the failure report template for what to capture."
        }
      ]
    }
  ]
}