{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Unblock Today page by surfacing actor/query prerequisite failures with reliable retry",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure Today page never gets stuck (indefinite skeleton or unrecoverable 'Unable to proceed') when nakshatra reading cannot be fetched, and always offers a working recovery action that can succeed without a full refresh once backend recovers.",
      "acceptanceCriteria": [
        "When the backend query for the current nakshatra fails, the Today page shows an error state with an actionable button that reliably triggers a new attempt (not a no-op).",
        "When the app cannot query because prerequisites are missing (e.g., actor not ready / query not eligible), the Today page does not remain stuck on a skeleton indefinitely; it shows a clear message explaining what is missing and offers a recovery action.",
        "After recovery (e.g., successful retry), the Today page proceeds to display nakshatra data without requiring a full page refresh."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/TodayPage.tsx",
          "operation": "modify",
          "description": "Replace the unconditional skeleton fallback for \"not actor ready / not query eligible\" with explicit prerequisite-aware UI states: (1) actor initialization failed (show clear message + Retry actor init button), (2) actor still initializing (show loading plus, after a short timeout, a \"still connecting\" message with Retry/Reload action), and (3) query eligible but backend call failed (keep existing error state but ensure the button triggers an actual refetch attempt). Use existing shadcn-ui Button/Skeleton primitives to keep UI consistent—verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useNakshatraNow.ts",
          "operation": "modify",
          "description": "Plumb through any newly-exposed actor prerequisite status from the underlying nakshatra query hook so TodayPage can distinguish \"actor loading\" vs \"actor failed\" vs \"query ineligible\" and can invoke a unified recovery action (retry actor init + retry nakshatra query)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Harden actor initialization handling on the frontend by surfacing initialization failures to the UI, distinguishing loading vs failure, and enabling user-triggered retries without editing immutable actor/auth hooks.",
      "acceptanceCriteria": [
        "If access-control initialization fails during actor creation, the app still obtains an actor instance when it is safe to do so, and the failure is reported (e.g., via error state/toast/log) instead of leaving the app unable to proceed.",
        "The actor hook exposes enough state to distinguish between \"actor still loading\" vs \"actor failed\" so pages can render an appropriate error UI instead of indefinite loading.",
        "Retrying actor initialization (via a user action such as reload/retry) results in a new initialization attempt."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActorInitStatus.ts",
          "operation": "create",
          "description": "Add a wrapper hook that derives actor initialization status and error information without modifying immutable files by reading the React Query state for the existing actor query key, and provide a user-invokable retry function that invalidates/refetches the actor query. Keep the API minimal (status, error, retry) so pages and query hooks can render correct prerequisite/error states."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update nakshatra query hook(s) to use the new actor-init status wrapper (instead of relying solely on actor presence + isFetching) so callers can distinguish actor loading vs actor failure. Expose additional state (e.g., actorInitStatus/actorInitError) plus a retryActorInitialization action; ensure these states are used to compute query eligibility and prevent \"enabled=false\" from producing an indefinite loading UX."
        },
        {
          "path": "frontend/src/pages/TomorrowPage.tsx",
          "operation": "modify",
          "description": "Adjust Tomorrow page usage of the nakshatra query hook to match the updated return shape (actor init status/error and retry action), ensuring no regressions and maintaining consistent recoverable error/loading behavior. Use existing shadcn-ui Button/Skeleton primitives—verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}