{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Today hero image asset resolution and move hero text to lower third",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure the Today hero background image \"Untitled design (33).png\" is present in frontend static assets and referenced in a production-safe way that handles special characters in the filename.",
      "acceptanceCriteria": [
        "On the Today page, the hero section displays the intended background image (not the previous image, not a blank background).",
        "The browser network tab shows the hero image request returns 200 (no 404) and no console errors related to loading the hero image.",
        "The solution works in both development and production builds (static asset resolution is correct)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/Untitled design (33).png",
          "operation": "create",
          "description": "Add the provided image asset to the correct static public assets location so it is served at runtime (ensure filename matches exactly, including spaces/parentheses)."
        },
        {
          "path": "frontend/src/pages/TodayPage.tsx",
          "operation": "modify",
          "description": "Update the hero backgroundImage to build the URL using the app's base URL (import.meta.env.BASE_URL) and wrap the URL in quotes inside CSS url(...), ensuring the path is safely encoded so spaces/parentheses resolve correctly in dev and production."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Move the Today hero overlay text block to the bottom lower third of the hero image while keeping it readable and responsive.",
      "acceptanceCriteria": [
        "The hero text block is visually located in the lower third of the hero area (not vertically centered).",
        "Text remains readable against the background (overlay/scrim still provides sufficient contrast).",
        "Layout remains responsive: on small screens the text does not overflow or clip and maintains appropriate bottom padding."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/TodayPage.tsx",
          "operation": "modify",
          "description": "Adjust hero layout to a fixed/min height and reposition the overlay content using flex alignment (e.g., justify-end) and responsive bottom padding so the glyph, heading, and subtitle sit in the lower third; keep/adjust scrim (e.g., gradient overlay) to maintain contrast across mobile and desktop."
        }
      ]
    }
  ]
}