{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Current Position (GPS) city detection and persistence",
  "requirements": [
    {
      "id": "REQ-20",
      "summary": "Add a reliable “Use Current Position” flow in the City Picker using browser geolocation, with clear UI control and manual city selection fallback on any error.",
      "acceptanceCriteria": [
        "City Picker provides a clear control labeled in English (e.g., \"Use Current Position\") to trigger location detection.",
        "If geolocation is supported and the user grants permission, the app updates the selected location immediately (header city label/local time and Today page computation update without refresh).",
        "If geolocation is not supported, permission is denied, or a timeout/error occurs, the UI shows an English error message and the user can still select a city manually without being blocked."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/city/CityPicker.tsx",
          "operation": "modify",
          "description": "Implement a prominent \"Use Current Position\" Button in the dialog that triggers navigator.geolocation, shows an in-dialog loading state, and renders English error text on unsupported/denied/timeout/other errors while keeping manual city search/select unchanged. Use existing shadcn/ui Dialog, Button, Input, and ScrollArea components for consistent UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useCitySelection.ts",
          "operation": "modify",
          "description": "Expose a geolocation-friendly setter (or broaden the existing setCity) so CityPicker can set a geolocation-derived selection and the rest of the app reacts immediately (header label/local time and Today calculations) without requiring refresh."
        }
      ]
    },
    {
      "id": "REQ-21",
      "summary": "Allow geolocation-derived city selections to be persisted/restored from localStorage even if they are not in the predefined cities list, with safe validation and fallback to New York on invalid data.",
      "acceptanceCriteria": [
        "A geolocation-derived selection (name + valid IANA timezone + optional lat/lng) can be saved to and restored from localStorage without being rejected by validation.",
        "If a stored geolocation-derived selection is missing required fields or contains an invalid timezone identifier, the app falls back to the default city (New York) without crashing.",
        "Existing predefined-city selection behavior continues to work (selecting London/Paris/etc. still persists and restores correctly)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useCitySelection.ts",
          "operation": "modify",
          "description": "Update the city selection model/validation so it accepts either (a) a predefined city from frontend/src/data/cities.ts or (b) a geolocation-derived object with required fields (name, timezone) and optional lat/lng; validate timezone via Intl formatting, and fall back to DEFAULT_CITY (New York) when missing/invalid without crashing. Ensure localStorage persistence/restoration supports the broader model."
        },
        {
          "path": "frontend/src/data/cities.ts",
          "operation": "modify",
          "description": "Adjust the exported City type (or introduce a compatible widened type) so the app can represent both predefined cities and geolocation-derived selections without type conflicts, while keeping the existing predefined list intact."
        }
      ]
    },
    {
      "id": "REQ-22",
      "summary": "Derive timezone for geolocation selections without external services using device-resolved IANA timezone, and ensure Today computations and React Query refresh correctly when current position is selected.",
      "acceptanceCriteria": [
        "The geolocation-based selection includes a timezone string that passes Intl timezone formatting (no crashes in local time display).",
        "Today page continues to display \"Calculated for … local time (…timezone…)\" using the geolocation-derived timezone when current position is selected.",
        "Nakshatra results refresh correctly after selecting current position (no stale React Query result from the previously selected city/timezone)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/city/CityPicker.tsx",
          "operation": "modify",
          "description": "When geolocation succeeds, derive the timezone via Intl.DateTimeFormat().resolvedOptions().timeZone (no external services) and set a geolocation-derived selection (English display name such as \"Current Position\") that includes the timezone and optional lat/lng. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useCitySelection.ts",
          "operation": "modify",
          "description": "Ensure geolocation-derived selections store a timezone that is validated with Intl, and include a lightweight refresh token/selection identifier updated on each \"Use Current Position\" action so downstream computations can reliably rerun even when timezone is unchanged."
        },
        {
          "path": "frontend/src/hooks/useNakshatraNow.ts",
          "operation": "modify",
          "description": "Include the city selection refresh token/selection identifier in the effect dependencies so lunar longitude recomputes immediately after choosing current position, and pass a stable selection key to the data query hook to avoid reusing stale cached results."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the React Query queryKey inputs to incorporate the city selection key/refresh token (in addition to lunarLongitude/timezone/name) so selecting current position triggers a fresh query result rather than reusing cached data when values coincide."
        }
      ]
    }
  ]
}