{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-10T17:54:27.748Z",
  "summary": "Diff adds/changes frontend hooks to use a stable actor, adds sanitized console error logging, and updates ProfileSettingsPage to refetch logs/profile after saves. Backend shows new Nakshatra data structures/helpers and a BirthChartData shape containing moonNakshatra/atmakarakaNakshatra, but the diff does not provide evidence of Lahiri-ayanamsa-based computation/persistence nor evidence that authorization no longer blocks normal authenticated callers.",
  "missing_requirements": [
    {
      "id": "REQ-1",
      "requirement": "Fix Profile section save failures by ensuring authenticated users can successfully read/write their own UserProfile and BirthChartData without manual/admin-only access-control initialization; backend calls used by Profile page must not trap with authorization errors for a normal signed-in user.",
      "reason": "backend/main.mo still includes AccessControl/MixinAuthorization with an initialized access-control state and notes \"No migration\"; the truncated diff does not show any removal/relaxation of authorization gating for getCallerUserProfile, saveCallerUserProfile, getAllLogs, or saveBirthChart, so there is no diff evidence that normal callers won’t hit authorization traps or require prior admin initialization.",
      "evidence": [
        "backend/main.mo"
      ]
    },
    {
      "id": "REQ-2",
      "requirement": "Add deterministic Lahiri Ayanamsa-based computations (0–360 normalization and nakshatra segmentation) to derive Moon Nakshatra and Atmakaraka Nakshatra and persist them as part of the saved birth chart so subsequent reads return the stored values even if frontend input flow is unchanged.",
      "reason": "backend/main.mo shows a nakshatra list and a degree-to-nakshatra lookup helper, but there is no diff evidence of Lahiri ayanamsa adjustment, 0–360 normalization, or Atmakaraka derivation logic, nor evidence that saveBirthChart computes/stores these values server-side independent of frontend inputs.",
      "evidence": [
        "backend/main.mo",
        "frontend/src/hooks/useUserProfile.ts"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Introduced/modified a new stable-actor hook usage pattern (useActorStable) across log/profile hooks.",
      "reason": "BuildRequest did not ask for changing actor acquisition mechanics; it only constrained certain immutable hook paths (which were not touched) and requested save/auth fixes and Lahiri-based persistence.",
      "evidence": [
        "frontend/src/hooks/useUserLogs.ts",
        "frontend/src/hooks/useUserProfile.ts"
      ]
    },
    {
      "description": "Added backend helper functions and structures unrelated/insufficiently tied to requested Lahiri persistence (e.g., calculatePada, validateDegree, getCurrentDayOfYear changes, Nakshatra module equality).",
      "reason": "These helpers are not explicitly requested by the BuildRequest acceptance criteria (which focus on Lahiri adjustment + persistence and authorization/save success), and the diff summary does not connect them to implementing those requirements.",
      "evidence": [
        "backend/main.mo"
      ]
    }
  ],
  "confidence": 0.62,
  "changed_files": [
    "backend/main.mo",
    "frontend-file-summaries.txt",
    "frontend/src/hooks/useUserLogs.ts",
    "frontend/src/hooks/useUserProfile.ts",
    "frontend/src/pages/ProfileSettingsPage.tsx",
    "project_state.json"
  ]
}